[
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 334",
    "email": "anthony.anderson@howard.edu",
    "areas_of_expertise": [],
    "phone": "202-806-1587",
    "role": "Associate Professor",
    "department": "Accounting",
    "tags": "accounting",
    "education": [],
    "id": "aanderson",
    "biography": "",
    "name": "Anthony Anderson Ph.D."
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 334",
    "email": "hausman1229@gmail.com",
    "areas_of_expertise": [],
    "phone": "(202) 806-1676",
    "role": "Assistant Professor",
    "department": "Accounting",
    "tags": "accounting",
    "education": "",
    "id": "ahausman",
    "biography": "Dr. Hausman is the Associate Editor of the European Journal of Marketing for Social and Internet Marketing topics. Dr. Hausman holds a Ph.D. from the University of South Florida and an MBA from the University of Pittsburgh. She has over 50 publications in scholarly journals, including the Journal of the Academy of Marketing Science, Journal of Business Research, Journal of Advertising Research, Journal of Business and Industrial Marketing, Industrial Marketing Management, Journal of Services Marketing, and Journal of Consumer Marketing. In addition, she has made presentations at numerous international conferences including the American Marketing Association, Association for Consumer Research, and Academy of Marketing Sciences.<br><br>  Her current research is predominantly in the areas of Internet Marketing, including Social Media Marketing, Healthcare Marketing, Supply Chain Management, and International Marketing. Special interests include behavioral modeling, market research, brand management, innovation, marketing planning, and developing sustainable competitive advantage",
    "name": "Angela Hausman "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "althenry@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1508",
    "role": "Executive Assistant (Dean)",
    "tags": "administration",
    "education": "",
    "id": "ahenry",
    "biography": "",
    "name": "Althia Henry "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 440",
    "email": "anupam.kumar@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1603",
    "role": "Assistant Professor",
    "department": "Information Systems & Supply Chain Management",
    "tags": "infosys",
    "education": "",
    "id": "akumar",
    "biography": "",
    "name": "Anupam Kumar, Ph.D. "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "",
    "department": "",
    "education": [],
    "id": "amayse",
    "biography": "",
    "name": ""
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 447",
    "email": "amobolurin@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1601",
    "role": "Associate Professor",
    "department": "Information Systems & Supply Chain Management",
    "tags": "infosys",
    "education": "",
    "id": "amobolurin",
    "biography": "Dr. Mobolurin obtained a Ph.D. in Operations Research and Industrial Engineering from the University of Massachusetts at Amherst in 1983, where he also served as a Research and Teaching Associate. He has worked as a transportation systems analyst and consultant. He has conducted training sessions on Corporate Applications of MIS,                       for a USAID sponsored Executive Development Program. His current interests are in the area of application of Information Technology in decision-making, expert systems, group decision support systems and quality management.<br> <br> Dr. Mobolurin teaches Programming courses (Java, Visual C++.NET, C++), Information Systems Consulting, in the School of Business. He has taught courses in Expert Systems, Operations Research, Management Science, Statistics, Project Management, and Database Development. He joined the School of Business as an Assistant Professor in 1983and is currently an Associate Professor. He served as the Acting Chairman for the Department of Information Systems and Analysis from 1991 till 1993, and served as the Chairman till the 2000.<br> <br> He has worked as a Transportation Systems Analyst and Consultant and worked in Faculty Corporate Exchanges and Fellowships with Corning Glass Works, Eli Lilly, and Boeing Corporation<br> <br> He is a member of INFORMS, American Statistical Association, the Association for Computing Machinery. <ul>     <li>Areas of Expertise Information Systems/Decision Support Systems</li>     <li>Education Ph.D. Operations Research</li>     <li>Courses Taught Management Information Systems, Intro to Software Design, Programming (Java, Visual C++.NET, C++), Information Systems Consulting, Systems     Development, Seminar Emerging Information Technologies</li>     <li>Research Information Systems, Decision Support Systems, Operations Research</li> ",
    "name": "Ayodele Mobolurin Ph.D. "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "Associate Professor / Department Chair",
    "department": "Information Systems & Supply Chain Management",
    "tags": "infosys chair",
    "education": "",
    "id": "amorgan",
    "biography": "Dr. Allison J. Morgan is an assistant professor of Information Systems and Decision Sciences. She received her Ph.D. in Information Sciences and Technology from The Pennsylvania State University and a B.B.A. in Computer Based Information Systems from Howard University. Her dissertation research focused on the influences of online searching behavior for health information among Blacks and Whites. Her research interests focus on human information searching behavior, diversity of the information technology workforce, and the socio-cultural impact of technology. She has published articles on the impact of individual differences on user behavior, diversity in the global workplace, information searching behavior, and gender and information technology with specific focus on social networks and work-life balance among women. She was formerly employed as a consultant at Accenture and as a Usability Engineer at the United States Census Bureau. She is a member of the Ph.D. Project, Association for Information Systems (AIS), and the Golden Key National Honor Society.<br><br> Dr. Morgan teaches Introduction to Computers, Management Information Systems and Introduction to Software Design.",
    "name": "Allison J. Morgan Ph.D. "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "",
    "department": "",
    "education": [],
    "id": "aschmied",
    "biography": "",
    "name": ""
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "angela.tidwell@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1647",
    "role": "Assistant Professor",
    "department": "Information Systems & Supply Chain Management",
    "tags": "infosys",
    "education": "",
    "id": "atidwell",
    "biography": "",
    "name": "Angela L. Tidwell PhD"
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "anthony.wilbon@howard.edu",
    "areas_of_expertise": [],
    "phone": "202-806-1608",
    "role": "Assistant Dean for Administration and Associate Professor ",
    "department": "Information Systems and Supply Chain Management",
    "tags": "infosys administration",
    "education": "",
    "id": "awilbon",
    "biography": "",
    "name": "Anthony D. Wilbon Ph.D."
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 524",
    "email": "bchoi@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1532",
    "role": "Associate Professor",
    "department": "Finance & International Business",
    "tags": "finance",
    "education": "",
    "id": "bchoi",
    "biography": "",
    "name": "B. Paul Choi Ph.D."
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "Dean / Professor",
    "department": "Accounting",
    "tags": "accounting administration",
    "education": "",
    "id": "bharvey",
    "biography": " Under the distinguished leadership of Barron H. Harvey, Ph.D. the Howard University School of Business continues to make strides in its ongoing quest to maintain excellence in its academic programs. For the 2nd Year in a row, the School's Undergraduate Program was ranked among the Top 75 US programs in Business Week's 2008 Best Undergraduate B-Schools. It was among the top 20 schools in the Mid-Atlantic Region of the United States, 1 of 4 in the Washington DC Metro-Area and the only Historically Black University to be included in the ranking. In the September 2007 Wall Street Journal/Harris Interactive Survey of corporate recruiters on business schools, the School's MBA program maintained its ranking as one of the top three national institutions for hiring minority graduates. Additionally, the 2007 Princeton Review, again ranked the MBA Program among the top business schools in the nation, #1 ranking for the Greatest Opportunity for Minority Students and #5 ranking for Most Competitive Students. The School is also ranked as one of the top 70 undergraduate business programs in the nation by Businessweek magazine.<br> <br> In addition to the prestigious position as Dean of the School of Business, Dr. Harvey is a tenured member of the faculty and has served as a full professor in the Department of Accounting for over 18 years. In fall 2007, Dr. Harvey became the first endowed professor in the School of Business when he was named Frank Ross/KPMG Endowed Professor in Accounting. He has twice been named Educator of the Year by the National Association of Black Accountants Inc. (NABA). During his academic career he has held numerous other administrative positions at the University, including Director of Graduate Programs, Departmental Chairperson, and Interim Dean. Additionally he held other faculty appointments at the University of Nebraska, University of Miami and Georgetown University. He has lectured in various areas of management education including, Organizational Behavior, Management, and Accounting. As chairperson of the Department of Accounting, Dr. Harvey spearheaded the accreditation of the School's accounting program. This was a significant achievement giving the Howard University School of Business the distinction of being the first AACSB accredited accounting program in the Washington D.C. Metropolitan area. Most recently, under his leadership the School of Business was able to obtain reaffirmation of all its programs including separate reaffirmation of the Accounting program. During his tenure as Dean, the School of Business has developed partnerships with Universities throughout the Global Community including in Africa, the Caribbean, Asia and Europe. The School continues to recruit heavily from the Caribbean and Africa with about 40% enrollment of international students in its MBA program.<br> <br> Dr. Harvey understands that business must be conducted globally and the School's curriculum has been expanded to embrace this international perspective. Dr. Harvey has held offices and memberships in numerous professional organizations including, the American Institute of Certified Public Accountants, American Assembly Collegiate School of Business, American Accounting Association, Administrators of Accounting Program Group, Accounting Educational Change Commission, National Association of Black Accountants, and D.C. Board of Accountancy. He is also founder of several organizations, including the National HBCU Business Dean's Roundtable, Washington Consortium School of Business Research Forum and the African Venture Capital Association.Dr. Harvey's scholarly works include more than 20 published articles and presentations, and he has been a main speaker at major national and international events. He is an internationally renowned business management training specialist, and has appeared on numerous television programs to discuss business issues and cultural diversity. He has also been interviewed by network television regarding major US and global business news. In 1981, Dr. Harvey founded Harvey & Company, a consulting firm that continues to provide management and financial services to domestic and international clients in Africa and the Caribbean. Dr. Harvey earned an MBA degree in Accounting in 1975 and a Ph.D. degree in Organizational Behavior and Management Theory in 1977, both degrees from the University of Nebraska-Lincoln. He is a Certified Public Accountant, holding certifications with the District of Columbia and the State of Maryland. Currently, Dr. Harvey serves on numerous boards and committees including the HBCU Business Dean's Roundtable, Maintenance of Accreditation Committee of AACSB International, MDL Capital Management, Institute of Supply Management, The Washington Campus, Greater Southeast Health Care System, K.I.D.S. and Hope and A Future, Inc. He previously served as Chairman of the Board for the Fort Washington Hospital and was a member of the Research Committee of the Graduate Management Admission Council.",
    "name": "Barron H. Harvey Ph.D."
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "",
    "department": "",
    "education": [],
    "id": "cbuskey",
    "biography": "",
    "name": ""
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "Associate Professor",
    "department": "Information Systems & Supply Chain Management",
    "tags": "infosys",
    "education": "",
    "id": "cermer",
    "biography": " Charles Ermer joined the Department of Information Systems & Decision Sciences in 1988, after serving as Director of Marketing at Microtel Limited, Product Manager & Engineering Manager at Scientific Atlanta, Industrial Engineering Manager at Atlantic Steel, a member of the Technical Staff at TASC, and Bell Laboratories, and an Electrical Foreman at Bethlehem Steel.<br> <br> His primary research area of interest include: Decision Modeling, Personal Finance Models, and Teaching Improvement. Ermer received the award: Professor of the Year, ISA, in 1999 and in 2000.<br> <br> He has taught: Quantitative Business Analysis, Production/Operations Management (Graduate and Undergraduate), Statistics (Graduate).<br> <br> Ermer holds a Ph.D. from the John Hopkins University, Baltimore, MD, an MBA from Georgia State University, Atlanta, GA and a BES from the John Hopkins University, Baltimore, MD.",
    "name": "Charles Ermer Ph.D. "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 522",
    "email": "clittle@howard.edu",
    "areas_of_expertise": [],
    "phone": "202-806-1565",
    "role": "Instructor / Department Chair",
    "department": "Accounting",
    "tags": "accounting chair",
    "education": "",
    "id": "clittle",
    "biography": "",
    "name": "Carroll S. Little, DPA, CPA, CGFM"
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "",
    "department": "",
    "education": [],
    "id": "cmurthy",
    "biography": "",
    "name": ""
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 336",
    "email": "ddrozario@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1646",
    "role": "Professor",
    "department": "Marketing",
    "tags": "marketing",
    "education": "",
    "id": "ddrozario",
    "biography": "",
    "name": "Denver D'Rozario Ph.D. "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "",
    "department": "",
    "education": [],
    "id": "dfrazier",
    "biography": "",
    "name": ""
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "",
    "department": "",
    "education": [],
    "id": "dmason",
    "biography": "",
    "name": ""
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "Assistant Professor",
    "department": "Information Systems and Supply Chain Managment",
    "tags": "infosys",
    "education": "",
    "id": "dowunwanne",
    "biography": "         Dr. Daniel N. Owunwanne joined the Department of Information Systems &amp; Decision Sciences in 2003, after serving as Adjunct Professor at the University of         the District of Columbia, Washington DC, and Instructor at Elizabeth City State University, NC.         <strong>Research Interest:</strong> His primary research areas of interest include: Data Interoperability in Federated Distributed Database Systems, Software         Implemented Fault Tolerance, Error Detection in Data Transmission, and Cloud Computing.         <strong>Awards:</strong> His awards include: Software Engineering Certificate from Georgia State University; Computer Science Fellowship from NASA, Langley         Research Center in Hampton, Virginia; 2006-2007 Professor of the Year Certificate; Certificate of Special Congressional Recognition; and The U.S. President's 2007         Volunteer Service Award.         <strong>Professional Membership:</strong> Dr. Owunwanne is a member of a number of professional organizations which include: Interface of North America and         Classification Society of North America, International Digital Business Academy, Virginia Academy of Science, Association of Computing Machinery, Special Interest         Group on Computer Graphics, and National Association of Mathematics.         <strong>Courses Taught:</strong> He has taught: Database Management, Systems Analysis and Design, Information Structures, Management Information Systems,         Computer Introduction, Software Design, Data Communications, C++, and Java Programming Language.         <strong>Education:</strong> Dr. Owunwanne holds a Ph.D. from George Mason University, VA; M.S. from Howard University, Washington DC; and B.S. from State         University College, Buffalo, NY.         <strong>Research Publications</strong> (Five Most Recent Ones):         <ul>             <li>Owunwanne, Daniel; Goel, Rajni (2010), Radio Frequency Identification (RFID) Technology: Gaining A Competitive Value Through Cloud Computing.             International Journal of Management and Information Systems (IJMIS), Vol. 14, No. 4, 4<sup>th</sup>Quarter, 2010.</li>             <li>Owunwanne, Daniel; Okoro, Ephraim; Quasem, Mohammad (2010); Managing and Promoting Diversity in Educational Environment: Evaluation of Faculty Presence             and Equity Participation. International Journal of Effective Management (IJEM), Vol. 7, No. 1, June 2010.</li>             <li>Owunwanne, Daniel (2010), An Analysis of the Effectiveness of Error Detection in Data Transmission Using Polynomial Code Method. International Journal of             Management and Information Systems (IJMIS), Vol. 14, No. 2, 2<sup>nd</sup>Quarter, May 2010.</li>             <li>Owunwanne, Daniel (2009), The Importance of Software Implemented Fault Tolerance in Highly Reliable Systems. Washington Business Research Journal (WBRJ),             Vol. 1, No. 1, December 2009.</li>             <li>Owunwanne, Daniel (2009), Information Sharing In Homogeneous Federation of Databases And Performance Assessment, International Journal of Effective             Management, Vol. 6, No. 1, June 2009.</li>         </ul>     </div> </div>",
    "name": "Daniel N. Owunwanne Ph.D."
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "DPrentice@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1528",
    "role": "Associate Professor",
    "department": "Accounting",
    "tags": "accounting",
    "education": "",
    "id": "dprentice",
    "biography": " Deborah Prentice is an Associate Professor of Accounting in the School of Business at Howard University. The most recent schools where she previously taught are North Carolina A&T State University and the University of Massachusetts Dartmouth. She is a licensed CPA. Dr. Prentice's Ph.D. was earned at The University of Alabama. She earned an MBA and a BS in Accounting at Indiana University Northwest. She worked in the private sector for accounting firms for several years. Dr. Prentice is a member of the American Accounting Association, the American Institute of Certified Public Accountants, Beta Alpha Psi, and The PhD Project. Before working on her doctorate, Dr. Prentice taught accounting for a year at Stillman College. She did this while holding an accounting position in the private sector. This experience allowed her to share her love of accounting with students. While she was enjoying her Stillman experience she developed a love for teaching as well.",
    "name": "Deborah Prentice Ph.D."
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "",
    "department": "",
    "education": [],
    "id": "drozario",
    "biography": "",
    "name": ""
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 529",
    "email": "denise.streeter@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1531",
    "role": "Assistant Professor, Finance & International Business",
    "tags": "finance",
    "department": "",
    "education": "",
    "id": "dstreeter",
    "biography": "",
    "name": "Denise W. Streeter Ph.d., cpa"
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "Associate Professor",
    "department": "Finance & International Business",
    "tags": "finance",
    "education": "",
    "id": "dtaliefero",
    "biography": " Debby Lindsey-Taliefero, Ph.D. is an Associate Professor of Economics in the Department of Finance at Howard University. Her research efforts have focused on mortgage finance including foreclosures, delinquencies, and regulatory compliance; fair lending, and financial literacy.<br> <br> Dr. Lindsey-Taliefero has served as Project Manager for the Freddie Mac's CreditSmart Curriculum for Howard University. The CreditSmart project sheds light on minority group credit issues and has produced reports on credit behavior, focus groups, a national survey analyzing African American credit behavior, and a consumer credit education curriculum used at Howard University. In addition, she conducts student financial literacy surveys annually dating back to 2002 to assess students' financial literacy needs and knowledge. Her credit research is cited in 2002 congressional testimony before the U.S. Senate Hearing on The State Financial Literacy and Education in America.<br> <br> Dr. Lindsey-Taliefero served as an expert witness in a federal lawsuit in Tennessee on behalf of African-American plaintiffs alleging discrimination in automobile financing. Two major reports were produced by Dr. Lindsey-Taliefero, which lead to class action lawsuits settlements against Nissan Motors Acceptance Corporation and General Motors Acceptance Corporation. Her reports were featured or cited on ABC 20/20, in the New York Times, Washington Post, and in Department of Justice's Amicus brief in supporting the plaintiffs in the auto finance litigation. Nissan Motors Corporation Acceptance settled out of court in March of 2003 and the ramification of subsequence settlements radically improved pricing outcomes for minority borrowers.<br> <br> Dr. Lindsey-Taliefero has published in the Journal of Business & Economics Research, Journal of the Academy of Economics and Finance, Journal of Finance Case Research, Journal of Studies in Economics and Finance, Journal of Marketing Theory and Practice, Journal of Research on Minority Affairs, International Advances in Economic Research, Mortgage Banking Magazine, CRA Bulletin and numerous conference proceedings. She currently serves as advisor to the Mortgage Lending Industry: Strategic Market and Diversity Conference, Research Associate for the Center of Race and Wealth, and Advisor of the Golden Key International Honour Society.<br> <br> Prior to joining the faculty at Howard University, Dr. Lindsey-Taliefero worked as an Economist at Analytic Services, Inc. (Anser), the Federal Emergency Management Agency (FEMA), the National Urban League, and the Washington Bureau of the NAACP.",
    "name": "Debby Lindsey-Taliefero Ph.D."
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "dwunger@howard.edu",
    "areas_of_expertise": [],
    "phone": "202-806-1656",
    "role": "Associate Professor",
    "department": "Information Systems and Supply Chain Management",
    "tags": "infosys",
    "education": "",
    "id": "dunger",
    "biography": "  Dr. Darian Unger received his M.S and Ph.D. from MIT. Before joining the Howard University School of Business, he was an engineering program manager at Westinghouse Power Generation, consulted in the electric power industry, and taught at the Asian Institute of Technology. Dr. Unger's areas of expertise include innovation strategy, technology management, operations management, and new product development. He is especially interested in the development of new environmental and energy technologies. Professor Unger has published in the Journal of Engineering Design and the International Journal of Product Development, among others, and is a reviewer for several technology management journals and business textbooks. His other areas of interest include the role of government policies in spurring the development of green energy technologies, the role of information flows in new product development, and how the patent process influences both large corporations and individual entrepreneurs. Dr. Unger is the recipient of several teaching awards, including the Howard University Exemplary Teaching Award and the Information Systems Award for Outstanding Teaching. He lives with his wife and children in Silver Spring MD, where he was elected chairman of the Silver Spring Advisory Board. He is an active firefighter/EMT, with over a decade of service in the Silver Spring Volunteer Fire Department.<br> <strong>Areas of expertise:</strong> Innovation and technology management New product development Operations management and information flows Environmental energy industry<br> <strong>Education:</strong><br> Swarthmore College: B.S. in Engineering, B.A. in Political Science Massachusetts Inst. of Technology (MIT): S.M. in Technology Policy, S.M. in Civil &amp; Environmental Engineering, Massachusetts Inst. of Technology Ph.D. in Engineering Systems Management and Policy, Massachusetts Inst. of Technology<br>",
    "name": "Darian Unger Ph.D."
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "",
    "department": "",
    "education": [],
    "id": "dwilliams",
    "biography": "",
    "name": ""
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 500",
    "email": "everton.latty@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1513",
    "role": "Adjunct Professor",
    "department": "Management",
    "tags": "management",
    "education": "",
    "id": "elatty",
    "biography": " Professor Latty is passionate about emerging markets and emerging domestic markets private equity, securitizations, and minority participation in these spaces. He is co-founder and managing director of Corpelligence, a private equity firm that focuses on middle market investments in Latin America and the Caribbean (LAC). Professor Latty has worked on large private equity telecommunications and media transactions in the U.S. and in LAC. He is the former chairman of iDeal Decisions, Inc., an information technology firm; a board member of Recombinix, LLC, a biotechnology firm; and director at FMDI, a transport and logistics firm. Professor Latty has also worked on CMBS and CDO securitizations products at Criimi Mae, a former leader in the commercial mortgage-backed securities subordinate bond acquisition market. He was a summer intern at Merrill Lynch. He previously was general manager of an investment bank for an insurance group in the Caribbean where he conducted private placements, acquisitions, valuations, and other advisory roles. He also assisted a Caribbean government in their takeover of a distressed commercial bank.<br> <br> Professor Latty obtained his MBA in Finance from the University of Pittsburgh, an MS in Biotechnology from the Johns Hopkins University, a previous student at Harvard University, and completed options trading courses at Carnegie Mellon University. He is a Thomas Jefferson Fellow and serves as a member on the Silver Spring Transportation Management District Advisory Committee. Professor Latty teaches Venture Capital & Private Equity, a graduate course in the School of Business at Howard University.",
    "name": "Everton S. Latty "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "efua.obeng@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202)8061676",
    "role": "Assistant Professor",
    "department": "Marketing",
    "tags": "marketing",
    "education": "",
    "id": "eobeng",
    "biography": "",
    "name": "E.B. Obeng Ph.D. "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 300",
    "email": "eaokoro@howard.edu",
    "areas_of_expertise": [],
    "phone": "202-806-1545",
    "role": "Associate Professor",
    "department": "Marketing",
    "tags": "marketing",
    "education": "",
    "id": "eokoro",
    "biography": "",
    "name": "Ephraim Okoro MBA, PhD "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "",
    "department": "",
    "education": [],
    "id": "ewilliams",
    "biography": "",
    "name": ""
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "Director of Finance and Operations",
    "tags": "administration",
    "department": "",
    "education": "",
    "id": "fpereira",
    "biography": "",
    "name": "Feraz Pereira "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "Professor (Visiting)",
    "department": "Accounting/ Director of the Center for Accounting",
    "tags": "accounting",
    "education": "",
    "id": "fross",
    "biography": " Frank K. Ross is currently the Director of the Howard University School of Business Center for Accounting Education and a Visiting Professor of Accounting teaching Auditing and Ethics.In December, 2003, he retired from KPMG LLP after providing over thirty-eight years of service. Prior to retiring, he was the Mid-Atlantic Area Managing Partner for Audit and Risk Advisory Services and Managing Partner of the Washington DC office. Frank was also a member of KPMG's Board of Directors and the Chairman of the Board of the KPMG Foundation. In 1968, Frank was one of the nine co-founders and the first President of the National Association of Black Accountants (NABA). Frank is a graduate of Long Island University where he earned a Bachelors of Science degree in Accounting and an MBA degree. He received the Distinguished Alumni Award from Long Island University in 1998 and an Honorary Doctors of Humane Letters in 2001. He was the first graduate of their School of Business, Public Administration and Information Services to be so honored by the University. In 2004, the University of the District of Columbia also awarded Frank an Honorary Doctors of Humane letters. In October 2008, Accounting Today named Frank to its 2008 list of the 100 Most Influential People in Accounting. Also in October 2008, Diversity Edge named Frank to its 2008 list of 20 National Diversity Champions. Frank has also written a book about his life as an immigrant and successful certified public accountant (CPA) entitled, Quiet Guys Can Do Great Things, Too: A Black Accountant's Success Story. The book, which features a foreword written by former Time Warner Inc. Chairman and CEO Richard D. Parsons, is a classic and triumphant American tale; a parable of how one man's awe and inspiration at life's possibilities was not thwarted or halted by the darker realities of racism, segregation and discrimination. All proceeds from the sale of the book are earmarked for scholarships for accounting students. Frank is currently a member on the Board of Directors of the following corporations: Pepco Holdings, Inc. (Chair of Audit Committee and member of the Human Resources Committee) and Cohen &amp; Steers Mutual Funds Group (Chair of Audit Committee). He was formerly a member of the board of NCRIC Group, Inc. (member of Audit Committee and the Governance Committee). He was also formerly a member of the Board of Trustees of Gallaudet University. In addition, he currently serves on the board of the following not-for-profit organizations: Hoop Dreams Scholarship Fund, Inc. (Chairman of the Board), The Greater Washington Urban League (Treasurer), and the Howard University Chartered Middle School for Mathematics and Science (Treasurer).",
    "name": "Frank K. Ross "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 565",
    "email": "glacy@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1577",
    "role": "Professor",
    "department": "Management",
    "tags": "management",
    "education": "",
    "id": "glacy",
    "biography": " Dr. Lacy has been affiliated with the Howard University School of Business for over 30 years as a faculty member, administrator, researcher, advisor and trainer. She has also held several administrative positions at Howard: Associate Provost, Senior Academic Administrator in the Office of the Vice President for Academic Affairs; and Vice President for Administration. Dr. Lacy has also served as Assistant Dean for the School of Business. She is presently the Chair of the Department of Management, Labor Relations and Hospitality, School of Business, serving a seventh term (21 years). She also served as the Director of the Institute for Labor-Management Relations at the School of Business, where, among other duties, she directed a graduate MBA program designed to train professionals in the field of labor relations.<br> <br> Dr. Lacy teaches courses in the subject areas of human resources management, general management, leadership and supervision, labor-management relations, organizational behavior, organizational development and change, and heads a special program in diversity and women in business. She has received numerous teaching awards, including several Teacher of the Year awards from the School of Business.<br> <br> Dr. Lacy is a lead trainer for the Howard University Professional Development and Leadership Academy, the university's training arm for employees. She is nationally known for her workshops, seminars, and consulting in management and leadership, human resources management, labor relations, conflict resolution, organizational change and valuing diversity. Her client list includes the US Departments of Defense, Justice, Agriculture, Commerce and Veterans' Affairs; the Social Security Administration, the National Labor Relations Board, Small Business Administration and GAO; the cities of Washington, D.C. and Baltimore, Md., as well as private sector organizations such as AT&T, Fannie Mae, Ford Motor Company, the International Institute for Education, the National Alliance of Postal and Federal Employees, the Hospital for Sick Children, and Howard University Hospital, to name a few.<br> <br> In addition to her work at Howard, Dr. Lacy serves as a Senior Fellow for the Center for Excellence in Municipal Management at George Washington University, where she conducts research and assists in the design and delivery of training programs for middle managers, principals, administrators and teachers of the District of Columbia and mid-level managers for the Council of Governments in the DC Metro area. She is also involved in a program at Georgetown University that assists former professional athletes with leadership and career development.<br> <br> A native Washingtonian, Dr. Lacy is a product of the DC Public Schools. She received her BA degree from Lincoln University (Pa.), magna cum laude, in Economics and Business Administration (Accounting). She holds a MBA degree in Management and a Ph.D. degree in Industrial Relations from the University of Wisconsin (Madison).",
    "name": "Gwynette P. Lacy Ph.D. "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 329",
    "email": "guang.yang@howard.edu",
    "areas_of_expertise": [],
    "phone": "202-806-1630",
    "role": "Assistant Professor",
    "department": "Marketing",
    "tags": "marketing",
    "education": "",
    "id": "gyang",
    "biography": "",
    "name": "Guang Yang Ph.D."
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "",
    "department": "",
    "education": [],
    "id": "hkathy",
    "biography": "",
    "name": ""
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "ibonaparte@howard.edu",
    "areas_of_expertise": [],
    "phone": "",
    "role": "Associate Professor",
    "department": "Accounting",
    "tags": "accounting",
    "education": "",
    "id": "ibonaparte",
    "biography": "",
    "name": "Issac Bonaparte Ph.D."
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 452",
    "email": "james.haddow@gmail.com",
    "areas_of_expertise": [],
    "phone": "(202) 806-1604",
    "role": "Director Center for Excellence in Supply Chain Management",
    "department": "Associate Professor",
    "education": "",
    "id": "jhaddow",
    "biography": "",
    "name": "James Haddow MBA "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "",
    "department": "",
    "education": [],
    "id": "jharris",
    "biography": "",
    "name": ""
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "",
    "department": "",
    "education": [],
    "id": "jhodge",
    "biography": "",
    "name": ""
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 520",
    "email": "jjeong@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1657",
    "role": "Professor",
    "department": "Finance & International Business",
    "tags": "finance",
    "education": "",
    "id": "jjeong",
    "biography": " Dr. Jin-Gil Jeong is a Professor of Finance at the Howard University School of Business in Washington, DC. He joined its Department of Finance and International Business in 1995 after working as lecturer/instructor for MBA and undergraduate courses at the Smith School of Business at University of Maryland, College Park, where he received his Ph.D. in Finance in 1994. He has taught Finance courses such as International Financial Management, Investments and Portfolio Analysis, Financial Management and Financial Derivatives.<br> <br> Dr. Jeong worked as an Economist at the Bank of Korea, the central bank of Korea, from 1979 to 1983, and as an International Trade Coordinator for an international trading company that specialized in the oil and fishery business, after completing his MBA program at University of Alaska, Anchorage in 1985.<br> <br> He has received a number of awards and distinctions including the commendation award from the Vice Prime Minister of Economic Planning and Finance of Korea, and the Best Paper Award at the 5th Annual Global Finance Conference held in Mexico City, Mexico. Dr. Jeong also won a prestigious Fulbright Scholar award and work as visiting professor/research fellow at Seoul National University, his alma mater, for July-December, 2011.",
    "name": "Jin-Gil Jeong Ph.D."
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "",
    "department": "",
    "education": [],
    "id": "joluwo",
    "biography": "",
    "name": ""
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "jean.wells@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1564",
    "role": "Associate Professor",
    "department": "Accounting",
    "tags": "accounting",
    "education": "",
    "id": "jwells",
    "biography": "  Jean Wells, a licensed CPA and attorney, is an Assistant Professor at Howard University School of Business where she teaches tax and accounting courses, including Accounting Principles I &amp; II, Business Law, Tax Principles, Management Accounting and Legal Environment . Ms. Wells is the faculty advisor for Beta Alpha Psi, the accounting honor society, and the supervising faculty and program coordinator for the Volunteer Income Tax Assistance program. Ms. Wells earned a Bachelor's in Business Administration (B.B.A.) Accounting from Howard University and a Juris Doctorate from George Washington University. In 2007, Ms. Wells was the first Professor in Residence in KPMG's Washington National Tax Legislative and Regulatory Services Group where she conducted tax research and tracked legislative and regulatory tax developments during a six-month residency program. Before joining the faculty full-time at Howard University, Ms. Wells was a manager in Deloitte's Washington National Tax Policy Services Group. Ms. Wells has also taught graduate level tax classes at the University of Maryland University College and Bowie State University, and undergraduate classes at Prince Georges Community College. Ms. Wells was featured in Black Enterprise magazine as a Tax Financial All-Star and has been quoted in tax articles appearing on blackenterprise.com. Ms. Wells has authored several articles, some of which have appeared in the Journal of Accountancy and The CPA Journal. Ms. Wells revises book chapters for the BNA Tax Practice Series. She has held membership in the AICPA, MACPA, American Bar Association, American Tax Association, and American Association of Attorney-CPA and has served on committees in some of these organizations.<br>",
    "name": "Jean Wells, Esq., CPA"
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "Associate Professor",
    "department": "Information Systems & Supply Chain Management",
    "tags": "infosys",
    "education": "",
    "id": "kagarwal",
    "biography": "Dr. Kamal Nayan Agarwal joined the Department of Information Systems & Decision Sciences in 2001, after serving as MIS Manager at Cornet Technology, Inc., Springfield, VA, Director at Rockman Cycle Industry of Hero Group, India.<br> <br> His primary research areas of interest include: Information Systems, Network and Internet Security, Web Security, Information Assurance, E-Commerce and E-Business, and other related areas in Information Systems. Along with his research papers, Agarwal has also published a book on Information Systems, and has delivered a key note address on Information Security at the INFOTECH, organized by the University of Mauritius and National Computer Board.<br> <br> He has taught: Network/Internet Security Management, E-Commerce, Data and Network Communications, and Management Information Systems (Graduate).<br> <br> Agarwal holds a Ph.D. in Business Administration qualified in Information Systems, MS in Philosophy in Business Administration from Himachal Pradesh University, Shimla, India, MS in Computer Systems Management from the University of Maryland University College, MD, MBA in Business Administration and Computer Systems Management, BBA in Business Management from Banaras Hindu University, India, Diploma in Computer Science from I.I.C.M., Ahemdabad, India, along with successfully completing a Professional MCSE Training Program.",
    "name": "Kamal Nayan Agarwal Ph.D."
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "",
    "department": "",
    "education": [],
    "id": "kgraves",
    "biography": "",
    "name": ""
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "",
    "department": "",
    "education": [],
    "id": "khaggins",
    "biography": "",
    "name": ""
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "",
    "department": "",
    "education": [],
    "id": "khampton",
    "biography": "",
    "name": ""
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "",
    "department": "",
    "education": [],
    "id": "knash",
    "biography": "",
    "name": ""
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "Associate Professor/ Director of Executive Programs",
    "department": "Executive Program",
    "education": "",
    "id": "kwells",
    "biography": "",
    "name": "Kim Wells"
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 518",
    "email": "liwarere@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1634",
    "role": "Associate Professor",
    "department": "Finance & International Business & Real Estate",
    "tags": "finance",
    "education": "",
    "id": "liwarere",
    "biography": "",
    "name": "L. Jide Iwarere Ph.D. "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 529",
    "email": "ljkelly@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1658",
    "role": "Associate Professor",
    "department": "Finance & International Business",
    "tags": "finance",
    "education": "",
    "id": "lkelly",
    "biography": " Dr. Lynne Kelly joined the Department of Finance, International Business, and Insurance in 2006, after serving as Senior Development Engineer at the Dow Chemical Company where she provided technical service and product development support for customers in North, Central, and South America. Her primary research areas of interest include: International Real Estate Investment, and Mutual Fund Performance. She has taught: Managerial Economics and Finance. Kelly holds a PhD in Finance from George Washington University, Washington DC, an MBA from Ohio State University, Columbus Ohio, and a BS in Mechanical Engineering from Carnegie Mellon University, Pittsburgh, PA.",
    "name": "Lynne Kelly"
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "lucy.lim@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1581",
    "role": "Assistant Professor",
    "department": " Accounting",
    "education": "",
    "id": "llim",
    "biography": "",
    "name": "Lucy Lim Ph.D"
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 561",
    "email": "mcrump@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1530",
    "role": "Assistant Professor",
    "department": "Management",
    "tags": "management",
    "education": "",
    "id": "mcrump",
    "biography": " Micah E. S. Crump is an assistant professor of Entrepreneurship in the Department of Management at Howard University. His research and publications center on Black entrepreneurship, with a focus on increasing its success rates. In addition to entrepreneurship, Dr. Crump has taught Human Relations & Organizational Behavior, Strategic Human Resource Management, and Dynamics of Management. He was a McNair Scholar, and holds memberships with the Beta Gamma Sigma Honors Society, the U.S. Association for Small Business and Entrepreneurship, and the Academy of Management. He has been employed by the Department of Health and Human Services, and has run several businesses including a family firm named Micah's Cafeteria, and a consulting firm. He was the Keynote speaker for the May 2005 Commencement ceremonies at Coppin State University.<br>",
    "name": "Micah E. S. Crump, PhD, MBA"
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 521",
    "email": "metta@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1598",
    "role": "Professor",
    "department": "Finance and International Business",
    "tags": "finance",
    "education": "",
    "id": "metta",
    "biography": "",
    "name": "Marumbok Etta-Nkwelle Ph.D "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "Associate Professor",
    "department": "Accounting",
    "tags": "accounting",
    "education": "",
    "id": "mhicks",
    "biography": " Dr. Margaret Hicks joined the Department of Accounting in 1987. Her primary research areas of interest include: Auditing, Financial Accounting, and The Accounting Profession. Hicks was selected as one of the Top 50 CPAs in the Washington, DC Metropolitan Area in 2005, and Arthur Andersen Professor, 1999-2002. She has taught Accounting Principles I, Accounting Principles II, and Auditing. Dr. Hicks holds a Ph.D. from University of Maryland, College Park, MD and an MBA and BS from Southern Illinois University, Carbondale, IL.",
    "name": "Margaret Hicks "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 522",
    "email": "mkavoossi@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1567",
    "role": "Fulbright-Johaness Kepler Distinguished Chair Professor",
    "department": "Finance & International Business",
    "tags": "finance",
    "education": "",
    "id": "mkavoossi",
    "biography": "",
    "name": "Masoud Kavoossi, Ph.D "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 553",
    "email": "mkhan@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1535",
    "role": "Associate Professor",
    "department": "Management / Director",
    "education": "",
    "id": "mkhan",
    "biography": " Dr. Maryam Khan holds a Ph.D. in Hospitality and Tourism Management from Virginia Tech, the terminal degree one can attain in the field. She is internationally known as an expert and as an educator in the field, a reputation that she has brought to Howard. BesidesDepartment of Management teaching, she is also involved in research, paper and chapter publication, refereed presentation, student advising, curriculum development, school committees, outreach activities, professional development, industry workshops, technological advancement, and other administrative activities to bring her experiences to the classroom and enhance the Hospitality Management Program. She has taught several hospitality and management courses at Howard University. Some of these courses are: Introduction to Hospitality Management, Food service Management, Lodging and Facility Management, Hospitality Marketing, Hotel, Motel and Restaurant Management, Convention and Meeting Management, Food Cost Control, and Management of Organization Behavior. She has published and presented more than fifty research papers in internationally known journals and meetings. Her research focus on customer service, minority issues, technology, current events and environmental concerns relating to lodging, foodservice, and meeting planning. She is a recipient of several academic and industry grants. She has worked at local, national, and international levels and tried to fulfill Howard University's vision of serving the global community.",
    "name": "Maryam Khan Ph.D. "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "Professor",
    "department": "",
    "education": "",
    "id": "mogbolu",
    "biography": "",
    "name": "Michael N. Ogbolu Ph.D. "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "",
    "department": "",
    "education": [],
    "id": "mquasem",
    "biography": "",
    "name": ""
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "M_C_washington@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1554",
    "role": "Assistant Professor",
    "department": "Marketing",
    "tags": "marketing",
    "education": "",
    "id": "mwashington",
    "biography": "",
    "name": "Melvin Charles Washington, PhD"
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "",
    "department": "",
    "education": [],
    "id": "nlattimer",
    "biography": "",
    "name": ""
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 441",
    "email": "nrustagi@howard.edu",
    "areas_of_expertise": [],
    "phone": "202-806-1606",
    "role": "Professor",
    "department": "Information Systems and Supply Chain Management",
    "tags": "infosys",
    "education": "",
    "id": "nrustagi",
    "biography": "",
    "name": "Narendra K. Rustagi PhD "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 319",
    "email": "pchoudhury@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1554",
    "role": "Professor Emeritus",
    "department": "Marketing",
    "tags": "marketing",
    "education": "",
    "id": "pchoudhury",
    "biography": " American Marketing Association. The American Marketing Association published these books.  Currently he is the Founding and Chief Editor of the Journal of International Marketing Strategy, published by Modern Technology and Management Institute Inc., USA, spring 2013. ISBN 2152-5307. The second issue of the Journal has already been published in Fall 2014. Dr. Choudhury has served as a Keynote Speaker, National Program Chairman, Proceedings Editor, and Co-Proceedings Editor, Track Chair and Session Chair of various national and regional conferences. He also serves as an Advisor of the Editorial Review Board, Journal of Effective Management, and International Islamic University Malaysia, and Journal of Case Studies in Management. Dr. Choudhury' s current research interests are in the area of Minority Consumers, Cross Cultural Analysis, Role of Marketing in Business & Economic Development, Global Marketing and Export Strategy, Marketing Strategies for Small Businesses including Franchising and Marketing Strategy Formulation and Implementation. Dr. Choudhury frequently conducts seminars in major U.S. cities, on Marketing Strategies for Small and 8(a) certified businesses, Franchisees/ Franchisers and on Internet Marketing Techniques. Dr. Choudhury also served for 18 years, as a Program Manager, Small Business, HBCU (Historically Black Colleges and Universities), Minority Institutions (MIs), and Mentor Protg Programs, with Department of Defense, Pentagon (MDA-Missile Defense Agency), where he held Top Secret Security clearance. In this capacity, he dealt with developing and reviewing public policy, congressional issues, and managed funds ($4 million a year) for distribution to HBCUs/MIs. He also serves as consultant to various universities, conducted seminars, taught courses, and served as visiting scholar/researcher/advisor/external examiner of doctoral and master's theses in India, Malaysia and Philippines, Fiji (University of South Pacific), and Mona School of Business, Kingston, Jamaica. He has also widely traveled to places like Vietnam, China, Brazil, Philippines, Malaysia and Singapore on educational tours and lectures.<br>",
    "name": "Pravat K. Choudhury Ph.D."
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 527",
    "email": "pfanara@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1593",
    "role": "Professor",
    "department": "Finance & International Business",
    "tags": "finance chair",
    "education": "",
    "id": "pfanara",
    "biography": " Dr. Phillip Fanara joined the Department of Finance, International Business and Insurance in 1985, after serving as Assistant Professor at the College of Business and Management, University of Maryland, College Park, MD., and Associate Instructor at Indiana University of Business, Bloomington, Indiana. His primary research areas of interest include: Investments, Corporate Finance, Financial Engineering, Economics, and Energy Markets. He has taught: Financial Engineering, Investments, Corporate Finance, Corporate Financial Strategy, Venture Capital, Investment and Portfolio Analysis, Investment Banking, and Bond Markets & Strategies. Fanara has received a number of awards and distinctions including: Chartered Financial Analyst (CFA) Charter October 1997, MBA Instructor of the Year: First Honorable Mention 1994 from the Graduate Business Student Association at Howard University, and Outstanding MBA Teacher of 1982 from the College of Business at the University of Maryland.<br> <br> Dr. Fanara has consulted for numerous government agencies, financial institutions, trade associations, and corporations such as, the Federal Energy Regulatory Commission, Thai Mutual Fund Co., Ford Motor Company, the American Gas Association, the Edison Electric Institute and Goldman Sachs & Company. He has lectured throughout the world, in such places as London, East Asia, and the countries of Malawi, Uganda.<br> <br> Fanara holds a Ph.D. in Economics: Finance and Public Utilities from Indiana University, Bloomington, Indiana, and an MA and BS in Economics, and Business Management respectively from the University of Rhode Island, Kingston, Rhode Island.",
    "name": "Philip Fanara Ph.D. "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "",
    "department": "",
    "education": [],
    "id": "pkellibrew",
    "biography": "",
    "name": ""
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "Poyewole@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1651",
    "role": "Professor",
    "department": "Marketing",
    "tags": "marketing",
    "education": "",
    "id": "poyewole",
    "biography": " Philemon Oyewole has been teaching in the department of marketing of the School of Business since the Fall of 1995. Prior to joining the Howard University faculty, he was a consultant with the World Bank for close to five years where he participated in several UN/World Bank projects. <strong>Areas of Expertise</strong> His areas of expertise are in services marketing, international marketing, macro marketing, and measures of consumer satisfaction. <strong>Education</strong> Ph.D. (1993), Marketing major, University of Aix-Marseille III, France.<br> M.Phil. (1988) Marketing major, University of Aix-Marseille III, France.<br> M.B.A. (1984) Marketing major, University of Ife, Nigeria.<br> B.Sc. (1981) Demography and Social Statistics, University of Ife, Nigeria. <strong>Courses Taught</strong> Marketing research, Services marketing, Principles of marketing, and Retailing. <strong>Publications</strong> Oyewole, Philemon, Muthulashmi Sankaran and Pravat Choudhury. 2011). Children's influence on parental purchase decisions in Malaysia, Innovative Marketing, Vol. 6, No.4, pp. 8-16. Oyewole, Philemon. 2010). Country segmentation of the international tourism market using propensity to travel and to spend abroad, Journal of Global Marketing, Vol. 23, No. 2; pp. 152-168. Oyewole, Philemon. 2009. A focus group study of factors affecting students' choice of HBCUs: Implications for marketing strategies, Washington Business Research Journal, Vol. 1, No.1, pp. 1-12. Oyewole, Philemon. 2009. Prospects for Latin America and Caribbean Region in the global market for international tourism: A projection to the year 2020, Journal of Travel and Tourism Marketing, Vol.26, No.1, pp. 42-59.",
    "name": "Philemon O. Oyewole Ph.D. "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "",
    "department": "",
    "education": [],
    "id": "qsabree",
    "biography": "",
    "name": ""
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "",
    "department": "",
    "education": [],
    "id": "rclark",
    "biography": "",
    "name": ""
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 347",
    "email": "ratna.dey@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1500",
    "role": "Professor",
    "department": "Accounting",
    "tags": "accounting",
    "education": "",
    "id": "rdey",
    "biography": "",
    "name": "R. Mithu Dey, PhD, CPA "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 443",
    "email": "rgoel@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1649",
    "role": "Associate Professor / Department Chair",
    "department": "Information Systems & Supply Chain Management",
    "education": "",
    "id": "rgoel",
    "biography": "",
    "name": "Rajni S. Goel Ph.D. "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 500",
    "email": "rayshad.holmes@howard.edu.com",
    "areas_of_expertise": [],
    "phone": "(202) 227-1911",
    "role": "Adjunct Professor",
    "department": "Management",
    "tags": "management",
    "education": "",
    "id": "rholmes",
    "biography": " Dr. Rayshad A. Holmes was recently appointed Director of the Division of Workforce Development for the Assistant Secretary of Preparedness and Response at the Department of Health and Human Services. In this role, Rayshad serves as the principal advisor of all human capital issues.<br> <br> Prior to joining the Department, Dr. Holmes served as VA's Human Capital Officer at the Office of Personnel Management. Dr. Holmes was responsible for managing VA's Strategic Management of Human Capital scorecard within the President's Management Agenda. Dr. Holmes played a key role in VA's promotion to Green in status and progress. Dr. Holmes has had the privilege of working for Accenture, LLP as a Human Capital Consultant. In this role Dr. Holmes actively engaged in several organizational design and training design and delivery projects for Fortune 500 clients. Dr. Holmes also contributed to the firm's internal growth by mentoring junior consultants and analysts and regularly recruiting on the firm's behalf.<br> <br> Dr. Holmes graduated from Georgetown University with a Bachelors of Science Degree in Business Administration and Human Resources Management. Before completing studies at Georgetown, Dr. Holmes was named a Patrick Healy Fellow. Dr. Holmes earned his Ph.D. in Business from George Washington University.<br> <br> Dr. Holmes was inducted into Beta Gamma Sigma. Beta Gamma Sigma is the business school equivalent of Phi Beta Kappa and represents the highest academic distinction awarded to graduates.<br> <br> Dr. Holmes is an adjunct professor at Howard University where he teaches courses in management, leadership and organizational behavior at the graduate and undergraduate level. Dr. Holmes also serves as core faculty for Executive MBA program. Dr. Holmes has served as a trustee at Greater Mount Calvary Holy Church, board member for Susie C. Owens Enterprises and is chief executive officer of WQC, Inc., a 501c3 organization purposed to help teens master financial management. Dr. Holmes is the author of two books and several academic publications. Dr. Holmes is also a member of Kappa Alpha Psi Fraternity, Inc.<br> <br> Dr. Holmes' research interests focus on emotional intelligence, management education, leadership, strategic human capital and financial literacy.<br> <br> When not in the office, classroom or boardroom, Dr. Holmes enjoys reading, traveling, mentoring and golfing.",
    "name": "Rayshad A. Holmes Ph.D."
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "r.price@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1639",
    "role": "Associate Professor",
    "department": "Finance and International Business",
    "tags": "finance",
    "education": "",
    "id": "rprice",
    "biography": " Dr. Price joined the Department of Finance, International Business and Insurance in Fall 2006. He teaches courses in Financial Management, Finance Principles, Real Estate/Housing Finance, and Financial Markets/Institutions. He holds a B.S. in Civil Engineering from Cornell University in Ithaca, NY and a Ph.D. in Finance from The Florida State University in Tallahassee, FL. His research interests include real estate finance, asset pricing, valuation, mutual funds, mortgage pricing and REITs. His research has been presented at meetings of the American Real Estate Society, American Real Estate Urban Economics Association, Financial Management Association, Florida Education Fund, PhD Project Doctoral Students Association, Southern Finance Association, and Southwestern Finance Association. His research appears in the Journal of Real Estate Research. He has been certified by the National Development Council as a Housing Finance Professional. Dr. Price has worked for the Consortium for Central Harlem Development and Turner Construction Company as a Financial Analyst, Financial Systems Analyst and Project Manager. He is a member of the American Finance Association, American Real Estate Society, American Real Estate Urban Economics Association, Financial Management Association, Southern Finance Association, Southwestern Finance Association and Western Finance Association. He is also an academic member of the National Association of Real Estate Investment Trusts (NAREIT) and the National Council of Real Estate Investment Fiduciaries (NCREIF). <strong>Research</strong> Brent, William, Kelly, Lynne, Lindsey-Taliafero, Debby and Price, Russell M., 2011; NAV and Risk: The Case of REITs, <em>Journal of Business and Economic Research,</em> Vol.9, No. 7, pp. 31-42. Brent, William, Kelly, Lynne, Lindsey-Taliafero, Debby and Price, Russell M., 2011; Determinants of Mortgage Delinquency, <em>Journal of Business and Economic Research,</em> Vol. 9, No. 2, pp. 27-48. Brent, William, Kelly, Lynne, Lindsey-Taliafero, Debby and Price, Russell M., 2010; U. S. Mortgage Foreclosures: An Analysis by State, <em>Academy of Economics and Finance Journal,</em> Vol. 1, No. 1, 2010; pp. 17-30. Price, Russell M., 2009; REIT Holdings and Performance, <em>Journal of Real Estate Portfolio Management</em>, Vol. 15, No. 1, pp. 33-44. Friday, H. Swint, Price, Russell M., and Sirmans, G. Stacy., 2006; Do Management Changes Matter: An Empirical Investigation of REIT Performance, <em>Journal of Real Estate Research,</em> Vol. 26, No. 2, pp. 131-148.",
    "name": "Russell Price Ph.D."
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "raysmith@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1520",
    "role": " Professor",
    "department": "Management",
    "tags": "management",
    "education": "",
    "id": "rsmith",
    "biography": "Raymond D. Smith holds an MBA (1981) and PhD (1988) from the Robert H. Smith School of Business at the University of Maryland, College Park. He has won two national awards for his research and has consulted for various organizations including the Ford Motor Company, The US Small Business Administration and the Kauffman Center for Entrepreneurship. His published works have dealt with such topics as strategic management of motor carriers, minority entrepreneurship and business ethics and social responsibility. He has published over 20 journal articles that range from conceptual works on ethics and market function to empirical works focusing on the strategic behavior of large groups of firms, minority entrepreneurs' management practices and ethical attitudes among religious and non-religious managers. His analytic techniques have included factor analysis, discriminant analysis, latent profile analysis and other sophisticated techniques of multivariate statistics. Some of the courses he has taught include: Strategic Management, Management and Organization Theory as well as Logistics and Supply Chain management at both the graduate and undergraduate level.<strong>Research</strong>Smith, R.; Corsi and Grimm;  Motor Carrier Strategies and Performance, Transportation Research Series A, Vol. 24A, no. 3, pp 201-210, 1990Smith, R.; Roberson-Saunders, P.; Fanara, P. The Impacts of 8(a) Program on Minority Firm Development and Growth Journal of Developmental Entrepreneurship. Spring 2004(Won John Jack Best Paper Award at the United States Association for Small Business and Entrepreneurship Annual Meeting, Myrtle Beach, SC 2003)Roberson-Saunders, P. and Smith, R.  Gender Differences in Minority Firm Hiring Practices and Customer Patronage Developmental Entrepreneurship 5<sup>th</sup> ed. ; C. Stiles; C. Galbraith Eds. , Elsevier Press, London, 2006Smith, R. The Value of Charity in a World of Profit Maximization Journal of Human Values, Vol. 14, no. 1, 49-63, Spring 2008; (17<sup>th</sup> highest ranked article based on online access in the 18 year history of the journal)Smith, R. A Study in Stakeholder Management: Sears in the Great Depression, GITAM Journal of Management, Vol.7, no.2, Fall 2009Smith, R. An Analysis of the Role of Greed in the Ongoing Global Financial Meltdown Journal of Human Values, Vol. 16, no. 1, 2010Smith, R. Debt Slavery and the Loss of Freedom accepted Sept, 2011 by the<br />Journal of Human Values http://jhv.sagepub.com/content/current. Vol. 18, no. 2, 2012Smith, R., Debode, J, and Walker A. The Influence of Age, Theism and Gender on Ethical Judgments, The Journal of Management, Spirituality and Religion. Forthcoming 2013.&nbsp;",
    "name": "Raymond D. Smith PhD"
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "rstraight@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1531",
    "role": "Professor",
    "department": "MANAGEMENT / Director Center For Excellence",
    "tags": "finance",
    "education": "",
    "id": "rstraight",
    "biography": " Dr. Ronald Straight joined the Department of Finance, International Business and Insurance in 1988, after serving as the Head at Surface Ship Overhaul Acquisition Branch at the Naval Sea Systems Command, Washington, DC. His primary research areas of interest include: Supply Chain Management and Applied Economics. He has taught: Procurement Management, Government Acquisition, Negotiations, Business Fluctuations and Forecasting, Managerial Economics and Macroeconomics for Business. Straight has received several awards and distinctions. He received the President's Award from the Logistics Management Institute. He has also been accepted as a Fellow of the National Contract Management Association. Straight, holds a DBA and an MBA from the George Washington University, Washington, DC and a BA from the University of Wisconsin, Madison, WI",
    "name": "Ronald L. Straight PhD "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 558",
    "email": "sharmeling@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1586",
    "role": "Associate Professor",
    "department": "Management",
    "tags": "management",
    "education": "",
    "id": "sharmeling",
    "biography": "",
    "name": "Susan S. Harmeling Ph.D. "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 344",
    "email": "harrdlul@aol.com",
    "areas_of_expertise": [],
    "phone": "(202) 806-1557",
    "role": "Assistant Professor",
    "department": "Accounting",
    "tags": "accounting",
    "education": "",
    "id": "sharvey",
    "biography": " Almost immediately after graduating from Fairfield University in 1972, he began work in the University Office of Student Affairs as a counselor to minority students. In 1976, he left Fairfield to become Director of Minority Student Affairs at Georgetown University. During more than twenty years at Georgetown, he held positions as Assistant to the President for Urban Affairs and Federal Relations (1985-88) and Vice President for Urban Affairs (1988-96). While at Georgetown, he served on numerous university and community boards including being a founding member, in 1981, of the Conference on Minority Affairs of the Association of Jesuit Colleges and Universities. He has served as a member of the boards of directors of both Fairfield University (1985-91) and St. Peter's College (1984-92). A graduate of Georgetown Law Center, presently he teaches law to undergraduate and graduate business students at Howard University and he also serves as a consultant for special projects to the President of Georgetown University.",
    "name": "Samuel Harvey "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "",
    "department": "",
    "education": [],
    "id": "skulkarni",
    "biography": "",
    "name": ""
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 525",
    "email": "smukherji@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1591",
    "role": "Professor",
    "department": "Finance & International Business",
    "tags": "finance",
    "education": "",
    "id": "smukherji",
    "biography": "",
    "name": "Sandip Mukherji, Ph.D., CFA "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 525",
    "email": "smukherji@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1591",
    "role": "Professor",
    "department": "Finance & International Business",
    "tags": "finance",
    "education": "",
    "id": "smukherji",
    "biography": "",
    "name": "Sandip Mukherji, Ph.D., CFA "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "spaschall@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1577",
    "role": "Associate Dean and Associate Professor",
    "department": "Management",
    "tags": "administration management",
    "education": "",
    "id": "spaschall",
    "biography": " Mr. Paschall, a native of Washington, D.C., completed his high school education at the St. Albans School for Boys in 1973. He then attended the University of Virginia, where he double majored in Psychology and Sociology and received the B.A. with highest distinction in 1977. He was also a member of Phi Beta Kappa and a senior resident in the University's Resident Staff Program. Mr. Paschall enrolled later that year in Harvard Law School, where he completed the J.D. degree in 1980. While at Harvard, Mr. Paschall was a member of the Civil RightsCivil Liberties Law Review and participated in an exchange program with the Boalt Hall School of Law at the University of California, Berkeley. Mr. Paschall began teaching at Howard University three months after his graduation from Harvard and shortly thereafter became a member of the District of Columbia Bar. He has published numerous articles, ranging from educational assessment to the legal liability of accountants, and holds a number of memberships in national legal associations and organizations. Taught through the case method, his legal courses stress the analytical reasoning concepts developed in a law school curriculum. Mr. Paschall has been recognized as an Outstanding Teacher in the School of Business on several occasions. Mr. Paschall also has served in a number of administrative positions in the School. As the Associate Dean, he is responsible for a range of assessment and continuous improvement activities. He also serves as the lead writer for accreditation projects, including faculty development, curriculum review and assessment, and those associated with the Association to Advance Collegiate Schools of Business  International. In his spare time, Mr. Paschall has participated in regional tennis tournaments, cycling, and running events and has volunteered for a variety of community service organizations.                        </div>                    </div>",
    "name": "Samuel Paschall"
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "",
    "department": "",
    "education": [],
    "id": "twaters",
    "biography": "",
    "name": ""
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "",
    "department": "",
    "education": [],
    "id": "vdates",
    "biography": "",
    "name": ""
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "",
    "email": "",
    "areas_of_expertise": [],
    "phone": "",
    "role": "",
    "department": "",
    "education": [],
    "id": "vsupel",
    "biography": "",
    "name": ""
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 517",
    "email": "wbarbee@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1594",
    "role": "Associate Professor",
    "department": "Finance & International Business",
    "tags": "finance",
    "education": "",
    "id": "wbarbee",
    "biography": " Dr. William Barbee joined the Department of Finance, International Business and Insurance in 1975, after serving as Financial Analyst, Morgan Guaranty Trust Company, New York, Financial Consultant at the Federal Reserve Bank of New York, Assistant Professor of Finance and Economics at University of Maryland Eastern Shore, Marketing Research and Analyst at the United States Steele Corporation, Pittsburg, PA, and Instructor at Montgomery College, Takoma Park, Maryland. His primary research areas of interest include: Cycles: Theory and Empirical Evidence, Application of Financial Statement and Valuation Criteria for the Estimation of Future Common Stock Returns, and Technical Analysis of the Financial Markets. Barbee is the founder of the Finance and Investment Club at Howard University. He has taught: Principles of Finance, Business Finance, Managerial Finance, Principles of Personal Financial Planning, Principles of Investments, Seminar in Finance, Business Fluctuations and Forecasting, and Managerial Economics.<br> <br> HDr. Barbee has also developed and taught Principles of Personal Financial Planning as an initial preparation for the Chartered Financial Consultant and Chartered Life Underwriter designation, and other courses in preparation for the Chartered Market Technician designation and the NASD Series 7 Examination.<br> <br> Barbee holds a Ph.D. from the Catholic University of America, Washington, DC, an MAT from the University of Massachusetts, Amherst, and a BA (honors) from the University of Maryland, College Park.",
    "name": "William Barbee Ph.D."
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 522",
    "email": "wbrent@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1632",
    "role": "Professor",
    "department": "Finance & International Business",
    "tags": "finance",
    "education": "",
    "id": "wbrent",
    "biography": " Dr. William Brent joined the Department of Finance, International Business and Insurance in 1990, after serving as Controller at the National Naval Medical Center, U.S. Navy, Financial Planner at Georgetown University Hospital and Blue Cross Blue Shield of the National Capital Region, and Faculty Mentor at Walden University. His primary research areas of interest include: Merger and Acquisitions, Capital Structure, and Corporate Finance Case Studies. Brent has received several awards and distinctions including Professor of the year, 1997, 1999, and 2002 at Howard University School of Business. He has taught: Principles of Finance, Finance Theory, Financial Management, Financial Policy & Decision-making, Advanced Corporate Finance, and Financial Strategy.<br><br> Dr. Brent has served as Associate Editor for Journal of Finance Case Study, International Quarterly Journal of Finance, Journal of Commercial Banking and Finance, and Journal of the International Academy for Case Studies. He holds memberships in the Health Care Financial Management Association, the American Finance Association, the    Financial Management Association, and the American Association of Individual Investors. He is also Principal Investigator for the Fat Pockets study of financial literacy sponsored by the United Negro College Fund (Special Programs) office.<br><br> Dr. Brent holds a DBA in Finance from Nova University, an MBA in Finance and Investment and a BS in Health Care Administration from George Washington University, Washington, DC.",
    "name": "William Brent Ph.D. "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 326",
    "email": "wgong@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1557",
    "role": "Associate Professor",
    "department": "Marketing",
    "tags": "marketing",
    "education": "",
    "id": "wgong",
    "biography": "Wen Gong is an associate professor of marketing in School of Business at Howard University. She has taught many different courses including Principles of Marketing, Consumer Behavior, Internet Marketing (both undergraduate and graduate, face to face and online), International Marketing (graduate), Marketing Management (graduate), and Marketing Research (both undergraduate and graduate). Her research interests are in the areas of Internet marketing and advertising, cross-cultural consumer behavior, and international marketing. Dr. Gong has published in many journals including Journal of Advertising Research, International Marketing Review, Journal of Macro Marketing, Journal of Asia-Pacific Marketing and Logistics, International Journal of Electronic Business, Business Horizons, Cross-culture Management: An International Journal, Journal of American Academy of Business, Cambridge and Journal of Asia Business Studies. Dr. Gong has attended and presented papers in numerous national and international academic conferences including American Marketing Association, American Academy of Advertising Asia-Pacific Conference, World Marketing Congress, European Advertising Academy International Conference on Research in Advertising, Academy of Marketing Science Cultural Perspectives on Marketing Conference, World Business Congress, International Business and Economy Conference, and Administrative Sciences Association of Canada Conference. Dr. Gong holds a bachelor's degree from Beijing University of      Posts and Telecommunications, a master's degree from the University of International Business and Economics, and a doctorate from George Washington University.",
    "name": "Wen Gong Ph.D. "
  },
  {
    "courses_taught": [],
    "selected_research": [],
    "room": "Room 335",
    "email": "yferguson@howard.edu",
    "areas_of_expertise": [],
    "phone": "(202) 806-1555",
    "role": "Associate Professor / Department Chair",
    "department": "Marketing",
    "tags": "marketing chair",
    "education": "",
    "id": "ymeyers",
    "biography": "Dr. Yuvay Jeanine Meyers is currently on faculty at Howard University's School of Business in the department of Marketing. Dr. Meyers graduated with honors from HowardUniversity with a Bachelors degree in International Business Marketing and then went on to American University to obtain a Masters in Public Communications. Before returning to graduate school, she worked in advertising for a couple of years with clients such as the American Red Cross and BellSouth. Dr. Meyers completed her Ph.D. in Advertising at the University of Texas at Austin. Currently, she is a tenure track Assistant Professor of Marketing. Her research interests focus on representation of Blacks in advertising and their consumer behavior in the marketplace.",
    "name": "Yuvay Meyers Ferguson, Ph.D. "
  }
]
